## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 7 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           RESOURCE                            |
|--------|---------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.superset_docs_errors`       |
|        | `aws_cloudwatch_metric_alarm.superset_docs_errors`            |
|        | `aws_cloudwatch_metric_alarm.superset_docs_health_check`      |
|        | `aws_cloudwatch_metric_alarm.superset_docs_invocation_errors` |
|        | `aws_cloudwatch_query_definition.superset_ecs_errors`         |
|        | `aws_ecr_lifecycle_policy.superset_docs`                      |
|        | `aws_wafv2_web_acl.superset_docs`                             |
| update | `aws_cloudfront_distribution.superset_docs`                   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.superset_docs will be updated in-place
  ~ resource "aws_cloudfront_distribution" "superset_docs" {
        id                              = "EWHUI4SV6INWU"
        tags                            = {
            "CostCentre" = "cds-superset-docs-prod"
            "Terraform"  = "true"
        }
      + web_acl_id                      = (known after apply)
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_cloudwatch_log_metric_filter.superset_docs_errors will be created
  + resource "aws_cloudwatch_log_metric_filter" "superset_docs_errors" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/cds-superset-docs"
      + name           = "error-superset-docs"
      + pattern        = "ERROR? Error? error?"

      + metric_transformation {
          + default_value = "0"
          + name          = "error-superset-docs"
          + namespace     = "superset-docs"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.superset_docs_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_docs_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:066023111852:cloudwatch-alert-warning",
        ]
      + alarm_description                     = "`superset-docs` errors logged over 1 minute."
      + alarm_name                            = "errors-superset-docs"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "error-superset-docs"
      + namespace                             = "superset-docs"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:066023111852:cloudwatch-alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags                                  = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_docs_health_check will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_docs_health_check" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:066023111852:cloudwatch-alert-warning",
        ]
      + alarm_description                     = "`superset-docs` heath check has failed in a 2 minute period."
      + alarm_name                            = "health-check-superset-docs"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "HealthCheckId" = "0d9ea96a-40da-4f57-b308-c3c8ec55ef15"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "HealthCheckStatus"
      + namespace                             = "AWS/Route53"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:066023111852:cloudwatch-alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Minimum"
      + tags                                  = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_docs_invocation_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_docs_invocation_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:066023111852:cloudwatch-alert-warning",
        ]
      + alarm_description                     = "`superset-docs` invocation errors logged over 1 minute."
      + alarm_name                            = "invokcation-errors-superset-docs"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:066023111852:cloudwatch-alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags                                  = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_query_definition.superset_ecs_errors will be created
  + resource "aws_cloudwatch_query_definition" "superset_ecs_errors" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/cds-superset-docs",
        ]
      + name                = "Superset Docs - errors"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /(?i)error/
            | sort @timestamp desc
            | limit 100
        EOT
    }

  # aws_ecr_lifecycle_policy.superset_docs will be created
  + resource "aws_ecr_lifecycle_policy" "superset_docs" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 release tagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 git SHA tagged images"
                      + rulePriority = 10
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "sha-",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire untagged images older than 7 days"
                      + rulePriority = 20
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "cds-superset-docs"
    }

  # aws_wafv2_web_acl.superset_docs will be created
  + resource "aws_wafv2_web_acl" "superset_docs" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + description                 = "Superset Docs CloudFront distribution"
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "cds-superset-docs"
      + scope                       = "CLOUDFRONT"
      + tags                        = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "RateLimit"
          + priority = 40

          + action {
              + block {
                  + custom_response {
                      + response_code            = 429
                        # (1 unchanged attribute hidden)

                      + response_header {
                          + name  = "waf-block"
                          + value = "RateLimit"
                        }
                    }
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 1000
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "RateLimit"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "BlockLargeRequests"
          + priority = 1

          + action {
              + block {
                }
            }

          + statement {
              + or_statement {
                  + statement {
                      + size_constraint_statement {
                          + comparison_operator = "GT"
                          + size                = 8192

                          + field_to_match {
                              + body {
                                  + oversize_handling = "MATCH"
                                }
                            }

                          + text_transformation {
                              + priority = 0
                              + type     = "NONE"
                            }
                        }
                    }
                  + statement {
                      + size_constraint_statement {
                          + comparison_operator = "GT"
                          + size                = 8192

                          + field_to_match {
                              + cookies {
                                  + match_scope       = "ALL"
                                  + oversize_handling = "MATCH"

                                  + match_pattern {
                                      + excluded_cookies = []
                                      + included_cookies = []

                                      + all {}
                                    }
                                }
                            }

                          + text_transformation {
                              + priority = 0
                              + type     = "NONE"
                            }
                        }
                    }
                  + statement {
                      + size_constraint_statement {
                          + comparison_operator = "GT"
                          + size                = 8192

                          + field_to_match {
                              + headers {
                                  + match_scope       = "ALL"
                                  + oversize_handling = "MATCH"

                                  + match_pattern {
                                      + excluded_headers = []
                                      + included_headers = []

                                      + all {}
                                    }
                                }
                            }

                          + text_transformation {
                              + priority = 0
                              + type     = "NONE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "BlockLargeRequests"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 30

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRuleSet"
          + priority = 10

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesCommonRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 20

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "cds-superset-docs"
          + sampled_requests_enabled   = false
        }
    }

Plan: 7 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.superset_docs_errors"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
